#+property: board-name    Proplyd bowshocks
#+property: board-id      52091a8e59aa475c0d005603
#+property: DONE nil
#+property: TODO 52091a902f8f2d7c7e009182
High-level description of analysis of proplyd bowshocks

* Bowshock shapes
:PROPERTIES:
:orgtrello-id: 52091ab8c54dfb63510021f0
:END:

+ Purely empirical analysis of the shapes gives three fundamental parameters:
  + Projected distance: \(D'\)
  + Projected stand-off radius: \(R_0'\)
  + Projected radius of curvature: \(R_{\mathrm{c}}'\)
+ For a given model of the two winds (e.g., inner proplyd + outer isotropic), then we theoretically calculate \((R_0' / D', R_{\mathrm{c}}' / R_0') \) as a function of \(\beta, i\) where \(\beta\) is the wind-wind momentum flux ratio and \(i\) is the inclination. 

* Wind-wind proplyd models
:PROPERTIES:
:orgtrello-id: 52091abaa4cb978f7300333b
:END: 
+ We can estimate \((\beta, i)\) independently from known data about the proplyd and the wind.
+ \[
  \beta = \frac{\dot{M}_{\mathrm{eff}} V_{\mathrm{p}}} {\dot{M}_{\mathrm{w}} V_{\mathrm{w}}}
  \]
+ Effective proplyd mass-loss rate: \( \dot{M}_{\mathrm{eff}}\ = 4\pi r_0^2 n_0 m c_0 \)
+ We also have ionization balance
+ \[
  \frac{S_{\star}}{4 \pi D^2} = \alpha_{\mathrm{B}} n_0^2 \omega r_0
  \]
+ This implies that \(\dot{M}_{\mathrm{eff}} \propto r_0^{3/2} D^{-1}\) and \(\beta\) will go the same way, since the terminal velocity of the proplyd wind is not expected to vary much.
+ Alternatively, we could use the measured values of \(r_0\) and \(n_0\).  



** Distribution of proplyd sizes
+ I am measuring sizes for the Ricci (2008) sample with D' < 60 arcsec

*** Mis-classified objects
+ 168-235 :: high proper motion so clearly a jet knot
+ 187-314 :: has a star but no sign of proplyd: possibly has a jet knot or a binary companion
+ 160-253 :: from the proper motion looks like a complex jet knot that is going past a star
*** Objects with no obvious proplyd-morphology in H\alpha
+ 166-406 :: looks like proplyd from PC [O I] and [S II] images
  + present in Ricci catalog
+ 174-400 :: exactly the same as 166-406
  + *absent* from Ricci catalog
  + these two may be neutral proplyds


*** Obvious proplyds missing from Ricci catalog
+ 170-400 :: circular bright rim with dark disk inside
  + right on top of one of the HH529 shocks, which is why it might have been missed
+ 168-404 :: elliptical bright object - clearly not a point source - with bright star inside
+ 182-316 :: small proplyd with faint but well-defined tail
+ 181-401 :: a very faint tail, but definitely there
+ 153-321 :: looks most convincing in the Bally image
*** Shadow disks in the inner arcminute
+ 165-254 :: almost edge-on disk with reflection nebula
+ 167-231 :: circular disk with central star and the faintest of bright rims
  + I include this in the radius samples, but not the other two
+ 183-405 :: nice elliptical disk with star in middle
** TODO Variation in stellar wind
:PROPERTIES:
:orgtrello-id: 52091abb39ecbefd21004f7d
:END:
+ th1C is thought to be an oblique magnetic rotator
  + Stahl 1996 http://adsabs.harvard.edu/abs/1996A%26A...312..539S
  + period 15 days
  + angle \beta between magnetic axis and rotation axis \approx 45 deg
  + inclination i of rotation axis to line-of-sight \approx 45 deg
+ Papers on models of the wind
  + ud-Doula 2013 http://adsabs.harvard.edu/abs/2013MNRAS.428.2723U
+ Variation with latitude of \dot{M} and V_{\infty}
  + Do the papers give any information on this?
  + If not, we need to write to ud-Douls
+ Calculate relevant timescale for interaction of wind with proplyd:
  + t ~ R_{c} / V_{\infty}
  + Any shorter-scale variations in the wind will not affect the bowshocks
  + => average over orbital period will reduce the effects of variation with latitude of the wind parameters
  + We need to quantify this






** New table of relevant proplyds
:PROPERTIES:
:orgtrello-id: 52091abc9e9ef89a200058c5
:END:

+ From GAH 2002
  + \(V_{\mathrm{w}} = 1200~\mathrm{km\ s^{-1}}\)
  + \(\dot{M}_{\mathrm{w}} = 3.5 \times 10^{-7} M_{\odot}\ \mathrm{yr^{-1}} \)
+ which means that \(\beta\) is 
  + 4 $pi (1e14 $r14)**2 1e6 $N6 1.3 $mp (13.0 $km) (3.0 13.0 $km) / (3.5e-7 $Msun / $yr) (1200 $km)

| ! |        |       ID |     d |  r14 |  dr | dalph | dal | inc | dinc |  D17 |    N6 |  tau | beta            |
|---+--------+----------+-------+------+-----+-------+-----+-----+------+------+-------+------+-----------------|
| * | SC3    |  163-323 |  2.14 |  2.2 | 0.6 |     0 |  19 |  45 |   45 | 0.21 | 14.30 | 0.60 | 0.036 +/- 0.020 |
| * | LV4    |  161-324 |  6.05 |  3.5 | 0.3 |     7 |   6 |  45 |   15 | 0.59 |  6.21 | 0.48 | 0.040 +/- 0.007 |
| * | LV1b   | 168-326W |  6.34 |      |     |       |     |     |      |      |       |      | 0.000           |
| * | LV1    | 168-326E |  6.60 |  6.3 | 0.6 |    12 |  10 |  60 |   15 | 0.52 |  3.52 | 0.50 | 0.073 +/- 0.014 |
| * | *      |  168-328 |  6.64 |  2.8 | 0.3 |     0 |   5 |  30 |   15 | 0.91 |  6.03 | 0.38 | 0.025 +/- 0.005 |
| * | LV3    |  163-317 |  6.91 |  5.0 | 0.6 |     0 |  10 |  45 |   15 | 0.67 |  4.66 | 0.54 | 0.061 +/- 0.015 |
| * | LV2b   |  166-316 |  7.01 |  2.5 | 0.6 |    12 |   7 |  30 |   30 | 0.97 |  6.21 | 0.36 | 0.020 +/- 0.010 |
| * |        |  161-328 |  7.74 |  9.1 | 1.0 |    27 |   5 |  45 |    7 | 0.75 |  0.86 | 0.18 | 0.037 +/- 0.008 |
| * | LV2    |  167-317 |  7.83 |  7.9 | 0.3 |     3 |   1 |  60 |    7 | 0.62 |  3.86 | 0.70 | 0.126 +/- 0.010 |
| * | LV5    |  158-323 |  9.42 |  6.3 | 0.6 |     0 |   5 |  45 |   15 | 0.92 |  3.50 | 0.52 | 0.073 +/- 0.014 |
| * |        |  158-326 |  9.60 | 11.3 | 0.6 |     0 |   6 |  15 |   15 | 2.55 |  1.12 | 0.28 | 0.075 +/- 0.008 |
| * |        |  161-314 | 10.24 |  5.3 | 1.9 |     0 |  60 |  30 |    0 | 4.06 |  1.02 | 0.12 | 0.015 +/- 0.011 |
| * | LV6    |  158-327 | 10.60 | 16.6 | 1.6 |     0 |   5 |  45 |    7 | 1.03 |  0.78 | 0.29 | 0.112 +/- 0.022 |
| * | LV5b   |  157-323 | 10.97 |  2.5 | 0.3 |     0 |   3 |  60 |   15 | 0.87 |  6.07 | 0.34 | 0.020 +/- 0.005 |
| * |        |  171-334 | 14.29 |  4.7 | 0.3 |    35 |   8 |  45 |   45 | 1.39 |  3.49 | 0.41 | 0.040 +/- 0.005 |
| * | HST2   |  170-337 | 16.20 | 12.2 | 1.2 |     0 |  15 |  60 |   60 | 1.29 |  1.19 | 0.33 | 0.093 +/- 0.018 |
| * |        |  176-325 | 16.38 |  6.9 | 1.0 |    10 |   1 |  75 |   15 | 1.17 |  1.59 | 0.29 | 0.040 +/- 0.011 |
| * |        |  169-338 | 16.47 |  2.8 | 0.3 |     6 |   3 |  75 |   75 | 1.17 |  2.10 | 0.15 | 0.009 +/- 0.002 |
| * |        |  154-324 | 16.63 |  3.2 | 0.3 |    18 |   5 |  45 |   45 | 1.62 |  2.59 | 0.17 | 0.014 +/- 0.003 |
| * |        | 161-307W | 16.85 |      |     |       |     |     |      |      |       |      | 0.000           |
| * |        |  153-321 | 16.97 |  1.2 | 0.3 |     0 |  14 |  45 |   45 | 1.65 |  6.33 | 0.17 | 0.005 +/- 0.002 |
| * |        |  159-338 | 17.20 |  5.0 | 0.3 |     8 |   2 |  75 |   15 | 1.23 |  2.29 | 0.26 | 0.030 +/- 0.004 |
| * | HST 11 |  171-340 | 19.11 | 23.3 | 1.6 |     0 |   4 |  45 |   45 | 1.86 |  0.22 | 0.12 | 0.063 +/- 0.009 |
| * |        |  152-319 | 19.16 | 18.2 | 2.2 |     0 |  13 |  30 |   15 | 2.64 |  0.28 | 0.12 | 0.049 +/- 0.012 |
| * |        |  155-338 | 20.48 | 17.0 | 2.5 |     0 |   2 |  30 |    7 | 2.82 |  0.70 | 0.28 | 0.106 +/- 0.031 |
| * | HST 12 |  173-341 | 22.48 |  4.1 | 0.3 |    12 |   8 |  30 |   30 | 3.09 |  1.72 | 0.19 | 0.015 +/- 0.002 |
| * |        |  159-302 | 22.75 |  4.4 | 0.6 |     0 |  20 |  60 |   60 | 1.81 |  1.30 | 0.13 | 0.013 +/- 0.004 |
| * | *      |  180-331 | 25.12 | 12.2 | 1.2 |    15 |   3 |  60 |    7 | 2.00 |  0.73 | 0.23 | 0.057 +/- 0.011 |
| * | HST 1  |  177-341 | 25.84 | 20.4 | 1.6 |     8 |   2 |  60 |    7 | 2.05 |  0.62 | 0.29 | 0.135 +/- 0.021 |
| * |        |  154-346 | 27.21 |  1.9 | 0.3 |     0 |   1 |  75 |   15 | 1.94 |  5.51 | 0.32 | 0.010 +/- 0.003 |
| * | HST 3  |  159-350 | 28.35 | 20.1 | 1.6 |    18 |   2 |  75 |   15 | 2.02 |  0.65 | 0.30 | 0.137 +/- 0.022 |
| * |        |  160-353 | 30.79 |      |     |       |     |     |      |      |       |      | 0.000           |
|---+--------+----------+-------+------+-----+-------+-----+-----+------+------+-------+------+-----------------|
|   |        |          |       |      |     |       |     |     |      |      |       |      |                 |
#+TBLFM: $14=4 $pi (1e14 ($r14 +/- $dr))**2 1e6 $N6 1.3 $mp (13.0 $km) (3.0 13.0 $km) / (3.5e-7 $Msun / $yr) (1200 $km) ; f3

** Original table from Henney & Arthur (1998)
:PROPERTIES:
:orgtrello-id: 52091abc13ecaa6c2e002faf
:END:

Copied from [[file:~/Dropbox/Proplyds07/Proplyd2005/Sizes/proplyd-sizes.org]]

| ! |       ID |     d |  r14 |  dr | dalph | dal | inc | dinc |  D17 |    N6 |  tau | Omega/4pi         |
|---+----------+-------+------+-----+-------+-----+-----+------+------+-------+------+-------------------|
| * |  163-323 |  2.14 |  2.2 | 0.6 |     0 |  19 |  45 |   45 | 0.21 | 14.30 | 0.60 | 3.7e-5 +/- 3.5e-5 |
| * |  161-324 |  6.05 |  3.5 | 0.3 |     7 |   6 |  45 |   15 | 0.59 |  6.21 | 0.48 | 1.2e-5 +/- 3.7e-6 |
| * | 168-326W |  6.34 |      |     |       |     |     |      |      |       |      | 0.                |
| * | 168-326E |  6.60 |  6.3 | 0.6 |    12 |  10 |  60 |   15 | 0.52 |  3.52 | 0.50 | 4.8e-5 +/- 1.2e-5 |
| * |  168-328 |  6.64 |  2.8 | 0.3 |     0 |   5 |  30 |   15 | 0.91 |  6.03 | 0.38 | 3.1e-6 +/- 1.6e-6 |
| * |  163-317 |  6.91 |  5.0 | 0.6 |     0 |  10 |  45 |   15 | 0.67 |  4.66 | 0.54 | 1.8e-5 +/- 6.5e-6 |
| * |  166-316 |  7.01 |  2.5 | 0.6 |    12 |   7 |  30 |   30 | 0.97 |  6.21 | 0.36 | 2.2e-6 +/- 2.3e-6 |
| * |  161-328 |  7.74 |  9.1 | 1.0 |    27 |   5 |  45 |    7 | 0.75 |  0.86 | 0.18 | 4.8e-5 +/- 1.2e-5 |
| * |  167-317 |  7.83 |  7.9 | 0.3 |     3 |   1 |  60 |    7 | 0.62 |  3.86 | 0.70 | 5.3e-5 +/- 5.5e-6 |
| * |  158-323 |  9.42 |  6.3 | 0.6 |     0 |   5 |  45 |   15 | 0.92 |  3.50 | 0.52 | 1.6e-5 +/- 5.1e-6 |
| * |  158-326 |  9.60 | 11.3 | 0.6 |     0 |   6 |  15 |   15 | 2.55 |  1.12 | 0.28 | 6.5e-6 +/- 6.4e-6 |
| * |  161-314 | 10.24 |  5.3 | 1.9 |     0 |  60 |  30 |    0 | 4.06 |  1.02 | 0.12 | 4.7e-6 +/- 3.4e-6 |
| * |  158-327 | 10.60 | 16.6 | 1.6 |     0 |   5 |  45 |    7 | 1.03 |  0.78 | 0.29 | 8.6e-5 +/- 2.0e-5 |
| * |  157-323 | 10.97 |  2.5 | 0.3 |     0 |   3 |  60 |   15 | 0.87 |  6.07 | 0.34 | 2.7e-6 +/- 7.7e-7 |
| * |  171-334 | 14.29 |  4.7 | 0.3 |    35 |   8 |  45 |   45 | 1.39 |  3.49 | 0.41 | 3.8e-6 +/- 3.0e-6 |
| * |  170-337 | 16.20 | 12.2 | 1.2 |     0 |  15 |  60 |   60 | 1.29 |  1.19 | 0.33 | 3.0e-5 +/- 1.9e-5 |
| * |  176-325 | 16.38 |  6.9 | 1.0 |    10 |   1 |  75 |   15 | 1.17 |  1.59 | 0.29 | 1.2e-5 +/- 3.4e-6 |
| * |  169-338 | 16.47 |  2.8 | 0.3 |     6 |   3 |  75 |   75 | 1.17 |  2.10 | 0.15 | 1.9e-6 +/- 7.7e-7 |
| * |  154-324 | 16.63 |  3.2 | 0.3 |    18 |   5 |  45 |   45 | 1.62 |  2.59 | 0.17 | 1.3e-6 +/- 1.0e-6 |
| * | 161-307W | 16.85 |      |     |       |     |     |      |      |       |      | 0.                |
| * |  153-321 | 16.97 |  1.2 | 0.3 |     0 |  14 |  45 |   45 | 1.65 |  6.33 | 0.17 | 1.7e-7 +/- 1.6e-7 |
| * |  159-338 | 17.20 |  5.0 | 0.3 |     8 |   2 |  75 |   15 | 1.23 |  2.29 | 0.26 | 5.5e-6 +/- 7.7e-7 |
| * |  171-340 | 19.11 | 23.3 | 1.6 |     0 |   4 |  45 |   45 | 1.86 |  0.22 | 0.12 | 5.2e-5 +/- 4.1e-5 |
| * |  152-319 | 19.16 | 18.2 | 2.2 |     0 |  13 |  30 |   15 | 2.64 |  0.28 | 0.12 | 1.6e-5 +/- 8.1e-6 |
| * |  155-338 | 20.48 | 17.0 | 2.5 |     0 |   2 |  30 |    7 | 2.82 |  0.70 | 0.28 | 1.2e-5 +/- 4.4e-6 |
| * |  173-341 | 22.48 |  4.1 | 0.3 |    12 |   8 |  30 |   30 | 3.09 |  1.72 | 0.19 | 5.8e-7 +/- 5.3e-7 |
| * |  159-302 | 22.75 |  4.4 | 0.6 |     0 |  20 |  60 |   60 | 1.81 |  1.30 | 0.13 | 2.0e-6 +/- 1.3e-6 |
| * |  180-331 | 25.12 | 12.2 | 1.2 |    15 |   3 |  60 |    7 | 2.00 |  0.73 | 0.23 | 1.2e-5 +/- 2.6e-6 |
| * |  177-341 | 25.84 | 20.4 | 1.6 |     8 |   2 |  60 |    7 | 2.05 |  0.62 | 0.29 | 3.3e-5 +/- 5.6e-6 |
| * |  154-346 | 27.21 |  1.9 | 0.3 |     0 |   1 |  75 |   15 | 1.94 |  5.51 | 0.32 | 3.2e-7 +/- 1.0e-7 |
| * |  159-350 | 28.35 | 20.1 | 1.6 |    18 |   2 |  75 |   15 | 2.02 |  0.65 | 0.30 | 3.3e-5 +/- 5.7e-6 |
| * |  160-353 | 30.79 |      |     |       |     |     |      |      |       |      | 0.                |
|---+----------+-------+------+-----+-------+-----+-----+------+------+-------+------+-------------------|
|   |          |       |      |     |       |     |     |      |      |       |      | 5.5e-4 +/- 6.6e-5 |
#+TBLFM: $13=1.21 (1.e14 ($r14 +/- $dr))**2 / 4 ($d 440 $au / sin($inc +/- (0.5 $dinc)))**2 ; n2::@34$13=vsum(@I..@II); n2




* Return to theoretical shapes and approximations thereof

** Statistical study of projected shapes
+ Compare with Luis sample results for A' vs q'
+ We already have A' versus q'/q graphs for all conic sections
+ Combine with A(\beta) and q(\beta) curves
+ Use Monte Carlo to generate a cloud of points
+ Distributed in radius according to some law
*** Some general points
+ Mostly, A'/A < 1 and falls with inclination
  + Exceptions are with hyperbolae: for smallish A, A' starts to climb.  Also, A' curves up steeply just before reaching the maximum inclination (but this is unlikely to be seen, since it is over only a small range in i)

** Summary of current results
+ We have the analytic CRW results for both proplyd and isotropic case
+ We have circular fits to both
  + The parameter A describes the radius of curvature: A = R_c/R_0
  + We have a figure showing how this varies with momentum ratio: \beta
    + [[file:~/Work/Bowshocks/Jorge/bowshock-shape/AVSb.pdf][AVSb.pdf]]
    + Created by [[AvsBeta.py]]
  + /But this is contradicted by our work on the small-angle expansion of the CRW and proplyd shapes/
    + Jorge found that the on-axis Rc was identical for proplyd and isotropic cases
    + This can perhaps be reconciled since the R_{c} we measured here is a compromise value, fit to the curve from \theta = 0 \to 45\deg^{}, and is not necessarily equal to the on-axis value. 
+ We have calculated the projection effects on this A \to A\prime
  + /but we don't fully understand them/
** What still needs to be done
*** Understanding the difference between the proplyd and isotropic cases
+ We should compare shapes that have the same value of A
  + 1/A = y0 (e^{-\beta^{d}/b} - c) / (1 - c)
  + => \beta = -{b ln [ (1 - c)/(A y_0) + c]}^{1/d
  + For instance, A = 1.8 corresponds to 
    + Proplyd \beta = 0.02
    + Isotropic \beta = 0.001
*** DONE More approximations to the shell shape
CLOSED: [2014-05-06 Tue 23:11]
+ Circle: this works for \theta < 45\deg 
+ [X] Hyperbola/ellipse: still to do, should work better out to larger angles
  + [X] \theta vs \theta\prime
    + Do this in [[file:~/Work/Bowshocks/Jorge/bowshock-shape/Ellipse%20projection.ipynb][file:~/Work/Bowshocks/Jorge/bowshock-shape/Ellipse projection.ipynb]]
  + [X] R_{c}\prime/R_{0}\prime vs R_{0}\prime/D\prime
    + This is done for the circle \to ellipse \to parabola sequence in [[https://www.evernote.com/shard/s36/sh/821ee470-13aa-467d-9543-41062d406f08/f974d7b44c31e2b9a8f31e8fead6301a][these notes]]
    + [X] We still need to extend this to hyperbolae
      + DONE [2014-05-06 Tue] 

+ [X] R = 1 / cos(a \theta): still to do CANCELLED
  + This can fit the wings by construction since R \to \infty as \theta \to \pi/2a = \theta_{\infty}
  + But it doesn't work so well for \theta = 0 \to 120, which is the most important
  + Can be improved by taking 1 / cos^b(a \theta) with b = 1.4 but it isn't clear that the extra complication is worth it
+ [X] Small angle approximations to the CRW and modified CRW results
  + This should at least give us the radius of curvature on the axis
  + DONE [2014-05-06 Tue] Hand-written version in Evernote
    + And Jorge is writing it up in LaTeX
*** Finite thickness of inner shell
+ Necessary for calculating path length through shell
+ But also may affect the apparent shape of the shell
  + The shell brightness peak at each \theta will not be at the contact discontinuity, but will be offset by some fraction of h
  + Fraction of 0.5 if density is constant across shell, but in general it will vary:
    + On the axis, we know that density increases from shock to CD, so peak will be closer to CD than shock
      + For example, R - 0.3 h
    + For \beta > Mach angle (20\deg for M = 3) then shell flow is supersonic and divergent (probably), so density will /decrease/ from shock to CD, so brightness peak will be closer to the shock
      + For example, R - 0.7 h
  + We also have that h increases as some power of 1/cos\beta
    + Power index between 3 and 4 for the plane CD case
    + Still unknown for the curved CD case

* TODO Measure widths to calculate Mach number
:PROPERTIES:
:orgtrello-id: 52091abd0b1556e1050021a6
:END:

** Empirical measurements
:PROPERTIES:
:orgtrello-id: 52091abd0a34fc67310038e5
:END:
+ Jorge can do this
+ On the symmetry axis
+ Measure h'/R_{0}'
** Theoretical estimation
:PROPERTIES:
:orgtrello-id: 52091abe939d72bc49001c1f
:END:
+ h/R_{0} = k / M^{2} (para M >> 1)
  + Find constant k
  + Find how it is modified for small M
  + See Henney (2002) sec 4.3
+ Need to work out how this varies with inclination
  + h/R_{0} => h'/R_{0}'
** Relationship between projected FWHM, \Delta, and real width, h, for spherical homogeneous shells
:LOGBOOK:
CLOCK: [2013-09-18 Wed 23:39]--[2013-09-18 Wed 23:50] =>  0:11
:END:
+ Assuming the following:
  + spherical shell of outer radius R
  + and thickness H
  + constant emission coefficient, \eta 
+ Find surface brightness as function of projected radius, r
  + S(r) = \eta s(r)
  + s(r) is path length through shell
+ For r > R - H:
  + s_1(r) = 2 sqrt(R^2 - r^2)
+ For r < R - H:
  + s_2(r) = 2 {sqrt(R^2 - r^2) - sqrt[ (R - H)^2 - r^2 ]}
+ Maximum occurs at r = R - H: 
  + s_0 =  2 sqrt(R^2 - (R - H)^2 )= 2 sqrt((R^2 - (R^2 -2 R H + H^2)) = 2 sqrt[ H (2 R - H) ]
+ We can eliminate r in favour of X = R - r => r = R - X
+ {0 < X < H} : s_1(r) = 2 sqrt(R^2 - R^2 + 2R X - X^2) = 2 sqrt(X (2R - X))
+ {X > H} : s_2(r) = 2 sqrt(X (2R - X)) - 2 sqrt( R^2 - 2R H + H^2 - R^2 + 2R X - X^2)
  =  2 sqrt(X (2R - X)) - 2 sqrt( X (2R - X) - H (2R - H) )
+ Write h = H/R , x = X/H 
+ => s_1/s_0 = sqrt[ (X (2R - X) / H (2 R - H) ] = sqrt[ (X/H) (2 - X/R) / (2 - H/R)
+ => s_1/s_0 = sqrt[ x (2 - x h) / (2 - h) ]
+ and s_2/s_0 = sqrt[ x (2 - x h) / (2 - h) ] - sqrt{ [x (2 - x h) / (2 - h)] - 1 }
+ => s_2/s_0 =  sqrt[ x (2 - x h) / (2 - h) ] - sqrt( (x - 1) / (2 - h) ) = [sqrt(x(2 - xh)) - sqrt(x - 1)] / sqrt(2 - h)
  + Working: x (2 - x h) - (2 - h) = 2x - xh - 2 + h = -2 (1 - x) + h (1 - x) = (h - 2) ( 1 - x)  = (2 - h) (x - 1)
  + Remember x > 1 for s_2


* Measure shell densities to estimate stagnation pressure
:PROPERTIES:
:orgtrello-id: 52091abe161405ed7b001390
:END:
+ Use Ha surface brightness and model caclulation of path length


